grevaillot/svd_tools/headers/ATSAMV71Q19/usart0.h
/** @defgroup usart0_us_idr USIDR Interrupt Disable Register
@{*/

/** USART0_US_IDR_MANE Manchester Error Interrupt Disable **/
#define USART0_US_IDR_MANE		(1 << 24)
/** USART0_US_IDR_CTSIC Clear to Send Input Change Interrupt Disable **/
#define USART0_US_IDR_CTSIC		(1 << 19)
/** USART0_US_IDR_DCDIC Data Carrier Detect Input Change Interrupt Disable **/
#define USART0_US_IDR_DCDIC		(1 << 18)
/** USART0_US_IDR_DSRIC Data Set Ready Input Change Disable **/
#define USART0_US_IDR_DSRIC		(1 << 17)
/** USART0_US_IDR_RIIC Ring Indicator Input Change Disable **/
#define USART0_US_IDR_RIIC		(1 << 16)
/** USART0_US_IDR_NACK Non Acknowledge Interrupt Disable **/
#define USART0_US_IDR_NACK		(1 << 13)
/** USART0_US_IDR_ITER Max Number of Repetitions Reached Interrupt Disable **/
#define USART0_US_IDR_ITER		(1 << 10)
/** USART0_US_IDR_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART0_US_IDR_TXEMPTY		(1 << 9)
/** USART0_US_IDR_TIMEOUT Timeout Interrupt Disable **/
#define USART0_US_IDR_TIMEOUT		(1 << 8)
/** USART0_US_IDR_PARE Parity Error Interrupt Disable **/
#define USART0_US_IDR_PARE		(1 << 7)
/** USART0_US_IDR_FRAME Framing Error Interrupt Disable **/
#define USART0_US_IDR_FRAME		(1 << 6)
/** USART0_US_IDR_OVRE Overrun Error Interrupt Enable **/
#define USART0_US_IDR_OVRE		(1 << 5)
/** USART0_US_IDR_RXBRK Receiver Break Interrupt Disable **/
#define USART0_US_IDR_RXBRK		(1 << 2)
/** USART0_US_IDR_TXRDY TXRDY Interrupt Disable **/
#define USART0_US_IDR_TXRDY		(1 << 1)
/** USART0_US_IDR_RXRDY RXRDY Interrupt Disable **/
#define USART0_US_IDR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_imr USIMR Interrupt Mask Register
@{*/

/** USART0_US_IMR_MANE Manchester Error Interrupt Mask **/
#define USART0_US_IMR_MANE		(1 << 24)
/** USART0_US_IMR_CTSIC Clear to Send Input Change Interrupt Mask **/
#define USART0_US_IMR_CTSIC		(1 << 19)
/** USART0_US_IMR_DCDIC Data Carrier Detect Input Change Interrupt Mask **/
#define USART0_US_IMR_DCDIC		(1 << 18)
/** USART0_US_IMR_DSRIC Data Set Ready Input Change Mask **/
#define USART0_US_IMR_DSRIC		(1 << 17)
/** USART0_US_IMR_RIIC Ring Indicator Input Change Mask **/
#define USART0_US_IMR_RIIC		(1 << 16)
/** USART0_US_IMR_NACK Non Acknowledge Interrupt Mask **/
#define USART0_US_IMR_NACK		(1 << 13)
/** USART0_US_IMR_ITER Max Number of Repetitions Reached Interrupt Mask **/
#define USART0_US_IMR_ITER		(1 << 10)
/** USART0_US_IMR_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART0_US_IMR_TXEMPTY		(1 << 9)
/** USART0_US_IMR_TIMEOUT Timeout Interrupt Mask **/
#define USART0_US_IMR_TIMEOUT		(1 << 8)
/** USART0_US_IMR_PARE Parity Error Interrupt Mask **/
#define USART0_US_IMR_PARE		(1 << 7)
/** USART0_US_IMR_FRAME Framing Error Interrupt Mask **/
#define USART0_US_IMR_FRAME		(1 << 6)
/** USART0_US_IMR_OVRE Overrun Error Interrupt Mask **/
#define USART0_US_IMR_OVRE		(1 << 5)
/** USART0_US_IMR_RXBRK Receiver Break Interrupt Mask **/
#define USART0_US_IMR_RXBRK		(1 << 2)
/** USART0_US_IMR_TXRDY TXRDY Interrupt Mask **/
#define USART0_US_IMR_TXRDY		(1 << 1)
/** USART0_US_IMR_RXRDY RXRDY Interrupt Mask **/
#define USART0_US_IMR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_csr USCSR Channel Status Register
@{*/

/** USART0_US_CSR_MANERR Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) **/
#define USART0_US_CSR_MANERR		(1 << 24)
/** USART0_US_CSR_CTS Image of CTS Input **/
#define USART0_US_CSR_CTS		(1 << 23)
/** USART0_US_CSR_DCD Image of DCD Input **/
#define USART0_US_CSR_DCD		(1 << 22)
/** USART0_US_CSR_DSR Image of DSR Input **/
#define USART0_US_CSR_DSR		(1 << 21)
/** USART0_US_CSR_RI Image of RI Input **/
#define USART0_US_CSR_RI		(1 << 20)
/** USART0_US_CSR_CTSIC Clear to Send Input Change Flag (cleared on read) **/
#define USART0_US_CSR_CTSIC		(1 << 19)
/** USART0_US_CSR_DCDIC Data Carrier Detect Input Change Flag (cleared on read) **/
#define USART0_US_CSR_DCDIC		(1 << 18)
/** USART0_US_CSR_DSRIC Data Set Ready Input Change Flag (cleared on read) **/
#define USART0_US_CSR_DSRIC		(1 << 17)
/** USART0_US_CSR_RIIC Ring Indicator Input Change Flag (cleared on read) **/
#define USART0_US_CSR_RIIC		(1 << 16)
/** USART0_US_CSR_NACK Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) **/
#define USART0_US_CSR_NACK		(1 << 13)
/** USART0_US_CSR_ITER Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) **/
#define USART0_US_CSR_ITER		(1 << 10)
/** USART0_US_CSR_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART0_US_CSR_TXEMPTY		(1 << 9)
/** USART0_US_CSR_TIMEOUT Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) **/
#define USART0_US_CSR_TIMEOUT		(1 << 8)
/** USART0_US_CSR_PARE Parity Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_US_CSR_PARE		(1 << 7)
/** USART0_US_CSR_FRAME Framing Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_US_CSR_FRAME		(1 << 6)
/** USART0_US_CSR_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_US_CSR_OVRE		(1 << 5)
/** USART0_US_CSR_RXBRK Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_US_CSR_RXBRK		(1 << 2)
/** USART0_US_CSR_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART0_US_CSR_TXRDY		(1 << 1)
/** USART0_US_CSR_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART0_US_CSR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_rhr USRHR Receive Holding Register
@{*/

/** USART0_US_RHR_RXSYNH Received Sync **/
#define USART0_US_RHR_RXSYNH		(1 << 15)

#define USART0_US_RHR_RXCHR_SHIFT		0
#define USART0_US_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart0_us_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_thr USTHR Transmit Holding Register
@{*/

/** USART0_US_THR_TXSYNH Sync Field to be Transmitted **/
#define USART0_US_THR_TXSYNH		(1 << 15)

#define USART0_US_THR_TXCHR_SHIFT		0
#define USART0_US_THR_TXCHR_MASK		0x1ff
/** @defgroup usart0_us_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

