grevaillot/svd_tools/headers/ATSAMV71Q19/usart0.h
#define USART0_US_LONBL_LONBL_SHIFT		0
#define USART0_US_LONBL_LONBL_MASK		0x3f
/** @defgroup usart0_us_lonbl_lonbl LONBL LON Node Backlog Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_lonb1tx USLONB1TX LON Beta1 Tx Register
@{*/


#define USART0_US_LONB1TX_BETA1TX_SHIFT		0
#define USART0_US_LONB1TX_BETA1TX_MASK		0xffffff
/** @defgroup usart0_us_lonb1tx_beta1tx BETA1TX LON Beta1 Length after Transmission
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_lonb1rx USLONB1RX LON Beta1 Rx Register
@{*/


#define USART0_US_LONB1RX_BETA1RX_SHIFT		0
#define USART0_US_LONB1RX_BETA1RX_MASK		0xffffff
/** @defgroup usart0_us_lonb1rx_beta1rx BETA1RX LON Beta1 Length after Reception
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_lonprio USLONPRIO LON Priority Register
@{*/


#define USART0_US_LONPRIO_NPS_SHIFT		8
#define USART0_US_LONPRIO_NPS_MASK		0x7f
/** @defgroup usart0_us_lonprio_nps NPS LON Node Priority Slot
@{*/
/**@}*/


#define USART0_US_LONPRIO_PSNB_SHIFT		0
#define USART0_US_LONPRIO_PSNB_MASK		0x7f
/** @defgroup usart0_us_lonprio_psnb PSNB LON Priority Slot Number
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_idttx USIDTTX LON IDT Tx Register
@{*/


#define USART0_US_IDTTX_IDTTX_SHIFT		0
#define USART0_US_IDTTX_IDTTX_MASK		0xffffff
/** @defgroup usart0_us_idttx_idttx IDTTX LON Indeterminate Time after Transmission (comm_type = 1 mode only)
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_idtrx USIDTRX LON IDT Rx Register
@{*/


#define USART0_US_IDTRX_IDTRX_SHIFT		0
#define USART0_US_IDTRX_IDTRX_MASK		0xffffff
/** @defgroup usart0_us_idtrx_idtrx IDTRX LON Indeterminate Time after Reception (comm_type = 1 mode only)
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_icdiff USICDIFF IC DIFF Register
@{*/


#define USART0_US_ICDIFF_ICDIFF_SHIFT		0
#define USART0_US_ICDIFF_ICDIFF_MASK		0x0f
/** @defgroup usart0_us_icdiff_icdiff ICDIFF IC Differentiator Number
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_wpmr USWPMR Write Protection Mode Register
@{*/


#define USART0_US_WPMR_WPKEY_SHIFT		8
#define USART0_US_WPMR_WPKEY_MASK		0xffffff
/** @defgroup usart0_us_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** USART0_US_WPMR_WPEN Write Protection Enable **/
#define USART0_US_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup usart0_us_wpsr USWPSR Write Protection Status Register
@{*/


#define USART0_US_WPSR_WPVSRC_SHIFT		8
#define USART0_US_WPSR_WPVSRC_MASK		0xffff
/** @defgroup usart0_us_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** USART0_US_WPSR_WPVS Write Protection Violation Status **/
#define USART0_US_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup usart0_us_version USVERSION Version Register
@{*/


#define USART0_US_VERSION_MFN_SHIFT		16
#define USART0_US_VERSION_MFN_MASK		0x07
/** @defgroup usart0_us_version_mfn MFN Metal Fix Number
@{*/
/**@}*/


#define USART0_US_VERSION_VERSION_SHIFT		0
#define USART0_US_VERSION_VERSION_MASK		0xfff
/** @defgroup usart0_us_version_version VERSION Hardware Module Version
@{*/
/**@}*/


/**@}*/
